const spookyEvents = [distortTitle];

function startRandomSpookyEvent(){
    spookyEvents[getRndInteger(0, spookyEvents.length)]();
}

function distortTitle(){
    var title = document.getElementById("title");
    var previousText = title.textContent;


    title.textContent = "Y̶̡̡̯̘̪͎̱͉̗͚̺̖̫̼̩̫̱͖͈͉͌́͑̽̃̈̎̊̆̉̔͐͋̌̕̚͜͝͝ͅo̷̧̤̤͐͊͆̒̌̎͊̀̔̾̓̂͆͌̓̾͛̃̀͌͊̏͘͝͝ü̷̧̧̹̣͓͙̻̪̟͖͇̪̝̦̤̠̜͖͈̭̤̰̤̤͚̮̝̔̾̍̈́̂̉͂͋̏͝ ̴̛̹̥̻̤̪̯̰͇̪̙̐̀͑͑̐͌̋̇͐̾̀̎̈́͋͐̈̂̽̕̚̕͝͠͝ͅą̸̨̡̢̧͈͍̳̹̤̭̠͓̻̰̥̓͌͗̒̂̀͆̃̅̍͒́͗̎̀ŗ̸̺͙̖̺̭̠̗͋ͅę̷̡̧̨̺͇̺̭̬̫͙̞̜͕̱͚̖͍̙̳͎̲̘̠̓̾̔̍̆͌̈͆̑͑̊͋̆̕̚͠ͅ ̶̡̗̩̲̣̦̝̞̟͉͐͑̇̐̇j̸͇͉͎̱̙̣̱̀͆͌̽̈́͑u̵̢̡̡̬̠̦̪̼͖͙̱͓̗͈̯͙͎̺͔̪̥̫͆̿͊͑̄̀̍̍̀͆̆̂͐̍̿͌̋̍̐͐͊̕̚͜͜͜͝s̵̛̪̟̍̐̐̍͌̈̄̋͋̃̃̿͆̓͛̆͗̃͠t̸̨͚͈̤̲̠̯͔̪͚̯͙̬̙͈̹̩̘̥̟͍̞͕͉̥̗͚̏ ̵̧̥̦̲̬̥̭̜̗̞͔̪̞̔̌͐͐͊̿͊̍͌̾̓̐̂͂̎̍̈͒̓͌̍̂̂̆͋̚͝͝ả̶̡̢̡̪̘͎̣̩̯̺̬͍̭̒̇̀̇̈́̌̒̐̂̇̀̊́̆͒̐̾͘͘͘͠͠͝ņ̶̬̯̘͓̬̹̳͕͈̜̞͙̺͍̘͉̹͉̰̪̙̰͓̅͊͐͗̽̚͘̚͝͝ ̸̥̳͎͚̣͈̝͙̺̓̽͐͗̍̽̉̈͠į̵̯͓̋̾̎͌͆̇̿̍͛̇̐̃̎̈́̈́̀́̓̈́̿̏̕̚̚͠͠ņ̸̦̪͔͙̞͉̯̠̤͇̟̥͕̤̜̠͓̳̩̩̰̱͙̹͉̔͌͗͑͒̇̔͋̀̐̑́̀͗͒̋̐̀̿̉͘͝s̴̳̗͓͎̣̼̳̣͇̬̙̗̲̘̞͖̠̬͇̞͓͛̏̉̌̌͋̋̆͆̏̋̓̋͆̉̚͘͠e̴̡̢̪̹̘̺̺͔͉͍̳̘̘̫̺̫̼̳̰̳̹̜̲̹͙͌͌̃̍͜͝ͅͅc̴̺͇̮̰̩̱̠̥͆͊̐̊̎̔̅̈́̄͊́̐̓͋̈̓̉̿̏̓̈́̉̆̓̒͠͠͝ť̵̢̲̘̦͍͈̺̹̮̣̰̙̗͇͕͛̊̆̋̒̿̆ͅͅ.̵̧̢̧̧̢̢̣̩̪͈̤̗̳̼͕̫͖̫̙̱̖̤̗̥̹̗̙̅̍ ̵̜̱̺̮̗̱͇̬̱̲͓̼̾̎̒̽̎̎͒͊̈́̚͠Ŵ̸̨̟̯͓̠͍̈́̋̽͌̏́͑ḛ̴̘̫̞̳̠̻̠̬̼̰̗̦͋͛̅̇̋̐͗̕ ̴̨̞̖̙͇̝̬͈̖͕͍̤̲̠̯̤̙̼̩͎̥̇̋̉͒̋̐̉̉̓͝ͅw̶̡̡̧̛͚̞̠͍̯̦̦̫̝̪̮̦̃͊̽̆i̶̞̣̖͈̬̘͛̄͋̾͐̑̽̑͗̒̇͝͝l̶̡̧͈̼̫̻̣̻̲͎͎̰̥̰͕̜̞̖̙̰̪͕͚̀͛̌̉͜l̷͕̼̑̀̊̈̏̚͠͝ ̴̥̘̮͈̟̈̑̂̅̅̂̑̊͑̊̉̎̍͂̑̈́̀͝c̸̩̈́͑͂͛̊̕͝l̷͔̥͇̠̪̻̑́̏͂̈̽̎̅͑̕ͅa̷̡̛̱̋̒̽̆͐́̎́̊̾̆͂i̵̹͙͛͐͐̋͋̿̉̿́̕͝͝͝ͅm̷̢̨̲̗̭̞̻̩̱̖̭̃̽͆̀̒́̈́͛̄̌̓͒͂̾̀͌̚ ̵̧̫̮̗̬̐͋̿̒̅̌̂ẙ̷̹͎̗̯̳̓̆͜o̷̲̗̲͙͕̳͗͗͗͐͛̐͒̍͑̕͝ư̶̧̨̡̪̫̫̱̞̮̄̋̔̈̔̋͐̎͆̊̒̎͆̊͌́̚̕͝͠r̶̨̨̛͇͓̦̹̗̭̞̩̜͎̗̼̳̼̫̭̹͍̬͇͍̎̃̈́͗̾́̽̔̆̐̌̒̕͝͠ ̵̨͔̜̘̯̹͖̞̞̤̝͈͓͈̟͉̰͕̺̰̮̫͙̝̏̓ͅS̸̟̱̤̳̹̾̔͂͋́̀̍͊͘ ̶̺͍̜̙̗̻͇̹̓̔̃̆͊̓͂͆̄́̋̌̈́̎̓̈̾͐͘͘̚̕͝Ơ̶̡͍̙̘̙͈̞̞̘͖̝̇̈̈̇͆̓͒͜͠͝ͅ ̷̢̧̛̻̞̜̘͚̣̼̱̦̬̳̮̠̳̠̅̽̅͐ͅÚ̶̢̦̟̫̣̦̲̮̫̻̬̟̥̙͙̜̮̱̰̺̭̘̇̇̽͆̂ͅ ̸̹͎͎͔̥͔͔̼̫̿͐̌͂̄̌͑̅̈́̄̕̚͝L̷̙̄́̾̅́͂̒͒̌̊̈́̿̈́̋̀͆̾͘͝";



    setTimeout(function(){title.textContent = previousText}, 3000);
}